{
    tips:[
	"[Realistic Combat] Hull damage reduces combat readiness.",
	"[Realistic Combat] Shots that totally penetrate the armor of a ship deal full damage.",
	"[Realistic Combat] The best defense against missiles is point defense.",
	"[Realistic Combat] The hull level diamond of your ship is blue; target, red; ally, green; enemy, orange. The flux level diamond of any ship is white but turns purple when that ship overloads.",
	"[Realistic Combat] Lead your target with the red circle appearing near it because the AI sees one near you.",
	"[Realistic Combat] Armor does not ablate.  Do not turn to face incoming fire with undamaged armor because the ship grid shows the integrity of surrounding nonessential compartments, damaging each of which inflicts bonus hull damage until it is destroyed.",
	"[Realistic Combat] The stated projectile speed of a ballistic or energy projectile weapon equals its stated range.",
	"[Realistic Combat] All ballistic or energy projectile weapons, vanilla and modded, have longer ranges and higher projectile speeds.",
	"[Realistic Combat] All launcher weapons, vanilla and modded, have faster and nimbler missiles.",
	"[Realistic Combat] The beams of all beam weapons, vanilla and modded, extend almost instantly.",
	"[Realistic Combat] Beam weapon damage decreases with the inverse square of distance but is smoothly limited to its stated value.",
	"[Realistic Combat] The range of a beam weapon is the range at which its damage decreases to 1.",
	"[Realistic Combat] Only hits that penetrate armor inflict damage.",
	"[Realistic Combat] Ships and armor have two layers: a thickly armored citadel of essential compartments surrounded by non-essential compartments under a thin surface armor layer.",
	"[Realistic Combat] A weapon can penetrate an equivalent thickness of rolled homogeneous armor equal to its damage, which is reduced by diffraction if the weapon fires a beam.",
	"[Realistic Combat] The physical thickness (mm) of the surface armor layer of a ship equals one fifteenth of its armor rating, which equals the total physical thickness of its armor.",
	"[Realistic Combat] A weapon penetrates a layer of armor if its damage equals or exceeds the physical thickness (mm) of the armor struck, divided by the sine of the angle at which the weapon hits the armor, times the factor by which the thickness of rolled homogeneous armor is equivalent composite armor for the damage type of the weapon.",
	"[Realistic Combat] The armor rating of a ship refers to the physical thickness of its armor, which is a composite rather than rolled homogeneous armor, which in turn is merely an ideal reference for calculations.",
	"[Realistic Combat] Kinetic projectiles are long-rod penetrators of strong, dense material designed to punch through armor by sheer kinetic energy; whereas high explosive projectiles have warheads that explosively form penetrators of molten metal on impact.",
	"[Realistic Combat] Composite armor is thinner against long-rod penetrators and thicker against explosive-formed penetrators, but explosive-formed penetrators inflict more damage because their behind-armor effects are greater.",
	"[Realistic Combat] Composite armor is equivalent to an identical thickness of rolled homogeneous armor against energy weapons. Projectile-firing ones deal their stated damage upon penetration; beam-firing ones, their diffracted damage. ",
	"[Realistic Combat] Composite armor is much thicker against fragmentation type weapons, but their shrapnel deals much more damage if it penetrates.",
	"[Realistic Combat] The fog of war dissipates in space: you can see across the entire battlefield.",
	"[Realistic Combat] Ships have high top speed but low maneuverability. Your fleet will accelerate headlong into and through the enemy, breaking formation and becoming mixed-in, unless ordered to spread and halt in time.",
	"[Realistic Combat] Fighters have long flight range, high top speed, and high maneuverability.  Order them to chase fast frigates and destroyers or swarm cruisers and capital ships.",
    ]
}
