{
    "acs_bounty_pather_1":{
    
        "trigger_marketFaction_any":["independent", "tritachyon"],
		
		"trigger_min_fleet_size": 10,

        #BOUNTY DESCRIPTION

        "job_name": "The Idol Hunter", # Default: "Unnamed job". Job name shown in the dialog pick list
        "job_description": "Greeting Starfarer!\n\n The following jobs has been assigned to you in light of your recent achievement, The jobs require you to pacify certain rogue asset, ==alive==, disable the asset ship along with the asset ==intact== and leave it there for our people to recover. \n\n Our recent intel suggest that asset last located around ==$constellation== constelation along quite number of potential obstacle, should you decide to accept this offer, Expect heavy resistance, \n Have fun hunting! \n \n Your Communication Officer stutter in panic in light of sudden intrusion into Fleet Communication Network, confused at how such intrusion can go unnoticed, you calm him down and begin to think the course of action should you to take.", # Default: blank. The description shown upon selecting the job.
                                                               # \n creates a line break, for example "Line one.\nLine two."
															   # \" adds quotation marks.
                                                               # == brackets create a highlight, for example "Text ==highlight== text."
                                                               # ^ uppercase the following letter of a text variable, for example "^$heIsSheIsTheyAre turning angry."
                                                               # %% allow the use of %, otherwise it will be interpreted as an escape character.
                                                               # $sonDaughterChild based on bounty commander gender.
                                                               # $fatherMotherParent
                                                               # $manWomanPerson
                                                               # $heSheThey
                                                               # $himHerThem
                                                               # $hisHerTheir
                                                               # $heIsSheIsTheyAre
                                                               # $himselfHerselfThemselves
                                                               # $system The star system that the bounty fleet is in.
                                                               # $location The body that the bounty fleet has been placed near.
                                                               # $shipName The name of the bounty flagship.
                                                               # $faction The name of the faction (with article) of the bounty fleet.
                                                               # $reward The amount of credits being given as a reward.
                                                               # $name The name of the bounty commander.
                                                               # $firstName The first name of the bounty commander.
                                                               # $lastName The last name of the bounty commander.
                                                               # $constellation The constellation that the bounty fleet is in.
                                                               # $shipFleet base on either the target being a ship alone, or a fleet.
        "job_comm_reply": "Yet another fools tricked by those accursed servant of moloch? Do you even understand the consequence of handing this vessel of mine to them?!, Look how your ignorance has brought you into!, How many more innoncent soul need to perish for this accursed idol? \n\n...You should never accept this job Starfarer... \n\n I pity your choices... i'm really sorry but i need you to perish here Starfarer... \n\n Forgive me...", # Default: none. The text shown if the player opens comms with the bounty fleet,
                                                             # If set as an empty string, displays "The other $shipOrFleet does not answer to your hails."
                                                             # If not set, defaults to the regular comm reply for the fleet's faction.
        "job_intel_success": "Your unknown contact congratulate for your recent accomplistment, expressing their interest in working with you again in foreseable future. \n Your Fleet Intellegence, report movement of sizeable number of unidentified fleet moving into wreck of \"asset\" fleet, not so long after you leave the location.", # Default: not shown. Short conclusion text shown in the intel object after the job has been COMPLETED SUCCESSFULLY.
        "job_intel_failure": "You Fleet Communication network, experience brief but dangerous series of intrusion, stopped only thanks to heroic effort of your Fleet Communication officers, enacting emergency safety protocol to secure Internal Fleet Communication Network again.", # Default: not shown. Short conclusion text shown in the intel object after the job has been failed through FLAGSHIP RECOVERY.
        "job_forFaction": "tritachyon", # Default: no faction. Note that unless "job_reputation_reward" is set to 0, successfully completing a bounty will improve relations by 5 points.
        "job_deadline": 360, # Default: no limit. The number of days to complete the bounty.
        "job_credit_reward": 900000, # Default: no credit reward. Number of credits to award the player on successful completion.
        "job_reward_scaling": 0, # Default: no scaling/bonus. Bonus credits based on FP. Bonus is the specified number multiplied by how many FP the bounty fleet was over their base FP.
        "job_reputation_reward":15, # Default: 5 rep points. Reputation benefit with the faction posting the bounty, if any, in case of success. Set to 0 to disable, does not scale
        "job_item_reward": { # Default: no item rewards. Lists special items that will be added to the post-battle loot. First value is the item id, second is the number to give the player.
            # Using the same syntax as Console Commands, blueprints may be added. ["fighter_bp", "industry_bp", "modspec", "ship_bp", "weapon_bp"]
            "omega_core":1,
        },
        "job_type":"assassination", # Default: assassination.
                # assassination: required only to disable the flagship, may recover it.
                # destruction: requires the complete destruction of the flagship without recovery.
                # obliteration: requires the complete destruction or disabling of the enemy fleet, may recover.
                # neutralisation: requires the destruction or disabling of 2/3rd of the enemy fleet, may recover.
        "job_show_type": true, # Default: true. Make sure to explain the mission objective in the bounty description if you choose to not use the default display.
        "job_show_captain": false, # Default: true. Whether to show the bounty fleet captain on the job board. If false, shows the flag of the giving faction.
        "job_show_fleet": "flagship", # Default: "vanilla".
                # How much of the fleet to show on the bounty board.
				# none
                # text: "The intel assessment notes the target fleet may contain upwards of %s ships."
                # flagship: only shows an image of the flagship
                # flagshipText: shows an image of the flagships and a text with the number of other ships
                # preset: only show an image of the Flagship and the preset fleet
                # presetText: show an image of the Flagship and the preset fleet, plus a text with the number of other ships
                # vanilla: shows the Flagship and the 9 biggest ships of the fleet, plus a text with the number of other ships
                # all: show an image of all the ships in the fleet.
        "job_show_distance": "vague", # Default: "vanillaDistance".
                # How precisely the distance to the target is shown on the bounty board.
                # none: Do not show the distance.
                # vague: "The target is located somewhere in the vicinity of the core worlds."
                # distance: "It is located roughly %s LY away from your current position."
                # system: "The target is located in the <system> system."
				# vanilla: "The target is located near a giant in a system with a yellow primary star, in the Nebulon constellation." Also shows a map during the bar dialog
                # vanillaDistance: "The target is located near a giant in a system with a yellow primary star, in the Nebulon constellation. It is located roughly %s LY away from your current position." Also shows a map during the bar dialog
				# exact: "The target is located near X in the Y system." Also shows a map during the bar dialog
		"job_show_arrow": false, # Default: false. Whether to show an arrow on the Intel map pointing from the start to the bounty target location. Should only be enabled when there is a good reason, to match vanilla.
        "job_difficultyDescription": "auto",  # Default: auto description shown. "none": no description, "auto": bounty board describes how dangerous the bounty is, any other text: bounty board displays the text.
        "job_pick_option": "Accept the job?", # Default: "Accept the job". The text option that, when selected, accepts the bounty job.
        
        #TARGET EXISTING FLEET

        #TARGET COMMANDER (OPTIONAL)

        "target_first_name":"\"Layla\"", # Default: randomly selected based on faction.
        "target_last_name":"The Wandering Saint", # Default: randomly selected based on faction.
        "target_portrait":"graphics/portrait/acs_portrait_female_indies_13.png", # Default: randomly selected based on faction. Id of the sprite in settings.json/graphics/characters or full file path.
        "target_gender":"FEMALE", # Default: ANY. [ANY, UNDEFINED, MALE, FEMALE] ANY will randomly pick between male and female to avoid oddities and issues with texts and portraits.
        "target_rank": "spaceCommander", # Default: "citizen". Rank from campaign.ids.Ranks [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Ranks.html]
        "target_post": "fleetCommander", # Default: "spacer". Post from campaign.ids.Ranks (yes, Ranks, posts are the bottom half). [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Ranks.html]
        "target_personality": "aggressive", # Default: Randomly selected. Personality from campaign.ids.Personalities ("timid", "cautious", "steady", "aggressive", "reckless")
        "target_aiCoreId": null, # Default: null (not an AI). The AI Core id of the bounty commander. Core will be dropped as loot. Options: [ null, "gamma_core", "beta_core", "alpha_core" ]
        "target_level": 20, # Default: 0. The level of the bounty commander
        "target_elite_skills":10, # Default: vanilla setting (2 by default). Overrides the regular number of elite skills, set to 0 to not use elite skills.
        "target_skill_preference": "YES_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE", # Default: "ANY".
		    # YES_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # ANY (from OfficerManagerEvent.SkillPickPreference)


        #TARGET FLEET

        "fleet_name":"Hand of Ludd", # Default: no name.
        "fleet_faction": "luddic_path", # Required. The faction id from [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Factions.html] or a custom faction id.
        # MagicLib includes a utility bounty faction that is forced to be neutral to everyone but the player under the id ["ML_bounty"].
        "fleet_flagship_variant":"acs_revelation_lp_bounty", # Required. The variant ID to use for the Flagship. Can be a list of variants to choose randomly from: [variant1,variant2,variant3]
        # Variant files that use ships or weapons from third party mods that may or may not be installed can be put in [data\config\modFiles\magicBounty_variants\shipVariantId.variant] to avoid crashing on launch if said mods are absent. The bounty will need the proper mod requirements to be generated without issue.
        "fleet_flagship_name":"Idol hunter", # Default: Random.
        "fleet_flagship_alwaysRecoverable": true, # Default: false. Whether the flagship will be always recoverable. Allowing this will still let the player fail the bounty if they were not supposed to recover the flagship.
        "fleet_flagship_autofit": false, # Default: false. Whether the flagship will be autofitted. When false, the Flagship does not receive D-mods or S-mods from the quality override.
        "fleet_preset_autofit": true, # Default: false. Whether the preset ships will be autofitted. When false, the preset ships do not receive D-mods or S-mods from the quality override.
        "fleet_scaling_multiplier": 1, # Default: no scaling. Dynamic reinforcements to match that amount of player fleet DP, set to 0 to ignore.
        "fleet_min_FP": 1200, # Default: no minimum. Minimal total fleet size, set to -1 to ignore.
        "fleet_composition_faction": "luddic_path", # Default: bounty fleet faction. Used if the extra ships don't match the fleet's faction. For example a pirate fleet of Hegemony deserters. Required for min FP and player adjustment.
        "fleet_composition_quality": 1, # Default: 1, use 2 for no Dmods.
        "fleet_transponder": false, # Default: true.
		"fleet_no_retreat": false, #Default: false.
        "fleet_behavior": "ROAMING", # Default:"GUARDED". The fleet's behavior on the campaign layer. Options: ["PASSIVE", "GUARDED", "AGGRESSIVE", "ROAMING"].
        # The musicSetId to use for the battle, defaults to no custom music.
        # IMPORTANT: This must be added to the mod's `sounds.json` file. See "music_combat" in the vanilla `sounds.json` for an example.
        "fleet_musicSetId": "music_luddite_encounter_hostile",

        #LOCATION

        "location_distance": "FAR", # Default: no preference. How far from the center to spawn the bounty fleet. Options: "CORE", "CLOSE", "FAR" or just left empty to ignore.
        "location_themes": [ # Default: no preference. System themes that are valid to spawn the fleet at.
            "theme_interesting",
            "theme_derelict_mothership",
            "theme_remnant",
            "theme_remnant_resurgent",

            "procgen_no_theme", #not so special bounties should add this attribute
            "procgen_no_theme_pulsar_blackhole", #or this one
        ],
        "location_themes_blacklist": [ # Default: none. System themes to never spawn the fleet at.
            "theme_already_occupied", #Will avoid systems with "hostile" themes taken from a merged list between mods. Includes all Remnant, Plague-Bearer, OCI, Blade-Breaker systems
            "theme_already_colonized", #Will explicitely exclude systems with active markets, kind of mandatory for pirate bounties given that faction colonize otherwise interesting systems with Nexerelin
            "theme_hidden", #Used by that one story system
        ],
        "location_entities": [ # Default: PLANET + JUMP_POINT + STABLE_LOCATION. Possible entities to spawn the fleet around.
            "station",
        ],
        "location_prioritizeUnexplored": true, # Default: false. Will pick in priority systems that have not been visited by the player yet, but won't override the distance requirements.
        "location_defaultToAnyEntity": true, # Default: false. If true and no suitable entity is found in any systems with the required Theme and distance, a random entity will be picked instead. Otherwise the script will ignore the distance requirements.
    },
	"acs_bounty_indies_1":{
    
        "trigger_marketFaction_any":["independent", "tritachyon", "pirates"],
		
		"trigger_min_fleet_size": 10,

        #BOUNTY DESCRIPTION

        "job_name": "The Wanderer", # Default: "Unnamed job". Job name shown in the dialog pick list
        "job_description": "An anonymous offers were send to your internal communcation network through unknown mean \n \n The message tells you to eliminate a certain nomadic colony fleets currently spotted around edges of sector fringe \n \n Luckly it seems only specified you to ==destroy== the leading ==flagship== , as whorever send you this jobs didn't care about anything but destruction of leading vessel \n \n Proceed with caution as the offers report of quite ==sizeable== number of escort and plethora of automated auxilia accompanying the main vessel.", # Default: blank. The description shown upon selecting the job.
                                                               # \n creates a line break, for example "Line one.\nLine two."
															   # \" adds quotation marks.
                                                               # == brackets create a highlight, for example "Text ==highlight== text."
                                                               # ^ uppercase the following letter of a text variable, for example "^$heIsSheIsTheyAre turning angry."
                                                               # %% allow the use of %, otherwise it will be interpreted as an escape character.
                                                               # $sonDaughterChild based on bounty commander gender.
                                                               # $fatherMotherParent
                                                               # $manWomanPerson
                                                               # $heSheThey
                                                               # $himHerThem
                                                               # $hisHerTheir
                                                               # $heIsSheIsTheyAre
                                                               # $himselfHerselfThemselves
                                                               # $system The star system that the bounty fleet is in.
                                                               # $location The body that the bounty fleet has been placed near.
                                                               # $shipName The name of the bounty flagship.
                                                               # $faction The name of the faction (with article) of the bounty fleet.
                                                               # $reward The amount of credits being given as a reward.
                                                               # $name The name of the bounty commander.
                                                               # $firstName The first name of the bounty commander.
                                                               # $lastName The last name of the bounty commander.
                                                               # $constellation The constellation that the bounty fleet is in.
                                                               # $shipFleet base on either the target being a ship alone, or a fleet.
        "job_comm_reply": "Are you one of those evil people send to eliminate us again? \n \n I beg you please just leave us alone, we just want to lives in peace, we want nothing but to survive and lives peaceful lives alone in this vast universe \n \n I hope you understand my friend, please dont step any further... \n \n lets you face the consequence....", # Default: none. The text shown if the player opens comms with the bounty fleet,
                                                             # If set as an empty string, displays "The other $shipOrFleet does not answer to your hails."
                                                             # If not set, defaults to the regular comm reply for the fleet's faction.
        "job_intel_success": "Upon destruction of their leading vessel, your intellegence officer report massive blips of signal coming from all over way to the remainder of target escort fleet, after you leaves \n \n  slaughtering every single remnant of defeated fleets left no room for neither captive nor civilian.", # Default: not shown. Short conclusion text shown in the intel object after the job has been COMPLETED SUCCESSFULLY.
        "job_intel_failure": "An anonymous message were sended again to your internal communication network, this time filled with insult and derogatory remark, expressing their profound dissapoitment of their expectation to you \n \n as they sarcastically thanks you for giving them enough time to leave the sector into unknown expanse before they able to be taken down.", # Default: not shown. Short conclusion text shown in the intel object after the job has been failed through FLAGSHIP RECOVERY.
        "job_forFaction": "tritachyon", # Default: no faction. Note that unless "job_reputation_reward" is set to 0, successfully completing a bounty will improve relations by 5 points.
        "job_deadline": 360, # Default: no limit. The number of days to complete the bounty.
        "job_credit_reward": 1400000, # Default: no credit reward. Number of credits to award the player on successful completion.
        "job_reward_scaling": 0, # Default: no scaling/bonus. Bonus credits based on FP. Bonus is the specified number multiplied by how many FP the bounty fleet was over their base FP.
        "job_reputation_reward":15, # Default: 5 rep points. Reputation benefit with the faction posting the bounty, if any, in case of success. Set to 0 to disable, does not scale
        "job_item_reward": { # Default: no item rewards. Lists special items that will be added to the post-battle loot. First value is the item id, second is the number to give the player.
            # Using the same syntax as Console Commands, blueprints may be added. ["fighter_bp", "industry_bp", "modspec", "ship_bp", "weapon_bp"]
            "omega_core":1,
        },
        "job_type":"assassination", # Default: assassination.
                # assassination: required only to disable the flagship, may recover it.
                # destruction: requires the complete destruction of the flagship without recovery.
                # obliteration: requires the complete destruction or disabling of the enemy fleet, may recover.
                # neutralisation: requires the destruction or disabling of 2/3rd of the enemy fleet, may recover.
        "job_show_type": true, # Default: true. Make sure to explain the mission objective in the bounty description if you choose to not use the default display.
        "job_show_captain": false, # Default: true. Whether to show the bounty fleet captain on the job board. If false, shows the flag of the giving faction.
        "job_show_fleet": "flagship", # Default: "vanilla".
                # How much of the fleet to show on the bounty board.
				# none
                # text: "The intel assessment notes the target fleet may contain upwards of %s ships."
                # flagship: only shows an image of the flagship
                # flagshipText: shows an image of the flagships and a text with the number of other ships
                # preset: only show an image of the Flagship and the preset fleet
                # presetText: show an image of the Flagship and the preset fleet, plus a text with the number of other ships
                # vanilla: shows the Flagship and the 9 biggest ships of the fleet, plus a text with the number of other ships
                # all: show an image of all the ships in the fleet.
        "job_show_distance": "vague", # Default: "vanillaDistance".
                # How precisely the distance to the target is shown on the bounty board.
                # none: Do not show the distance.
                # vague: "The target is located somewhere in the vicinity of the core worlds."
                # distance: "It is located roughly %s LY away from your current position."
                # system: "The target is located in the <system> system."
				# vanilla: "The target is located near a giant in a system with a yellow primary star, in the Nebulon constellation." Also shows a map during the bar dialog
                # vanillaDistance: "The target is located near a giant in a system with a yellow primary star, in the Nebulon constellation. It is located roughly %s LY away from your current position." Also shows a map during the bar dialog
				# exact: "The target is located near X in the Y system." Also shows a map during the bar dialog
		"job_show_arrow": false, # Default: false. Whether to show an arrow on the Intel map pointing from the start to the bounty target location. Should only be enabled when there is a good reason, to match vanilla.
        "job_difficultyDescription": "auto",  # Default: auto description shown. "none": no description, "auto": bounty board describes how dangerous the bounty is, any other text: bounty board displays the text.
        "job_pick_option": "Accept the job?", # Default: "Accept the job". The text option that, when selected, accepts the bounty job.
        
        #TARGET EXISTING FLEET

        #TARGET COMMANDER (OPTIONAL)

        "target_first_name":"Grand Admiral", # Default: randomly selected based on faction.
        "target_last_name":"\"Methuselah\"", # Default: randomly selected based on faction.
        "target_portrait":"graphics/portraits/portrait_hegemony05.png", # Default: randomly selected based on faction. Id of the sprite in settings.json/graphics/characters or full file path.
        "target_gender":"MALE", # Default: ANY. [ANY, UNDEFINED, MALE, FEMALE] ANY will randomly pick between male and female to avoid oddities and issues with texts and portraits.
        "target_rank": "spaceCommander", # Default: "citizen". Rank from campaign.ids.Ranks [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Ranks.html]
        "target_post": "fleetCommander", # Default: "spacer". Post from campaign.ids.Ranks (yes, Ranks, posts are the bottom half). [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Ranks.html]
        "target_personality": "aggressive", # Default: Randomly selected. Personality from campaign.ids.Personalities ("timid", "cautious", "steady", "aggressive", "reckless")
        "target_aiCoreId": null, # Default: null (not an AI). The AI Core id of the bounty commander. Core will be dropped as loot. Options: [ null, "gamma_core", "beta_core", "alpha_core" ]
        "target_level": 20, # Default: 0. The level of the bounty commander
        "target_elite_skills":10, # Default: vanilla setting (2 by default). Overrides the regular number of elite skills, set to 0 to not use elite skills.
        "target_skill_preference": "YES_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE", # Default: "ANY".
		    # YES_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_YES_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # YES_ENERGY_NO_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_YES_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_YES_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_NO_MISSILE_YES_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_YES_MISSILE_NO_DEFENSE,
		    # NO_ENERGY_NO_BALLISTIC_NO_MISSILE_NO_DEFENSE,
		    # ANY (from OfficerManagerEvent.SkillPickPreference)


        #TARGET FLEET

        "fleet_name":"Ziusudra", # Default: no name.
        "fleet_faction": "independent", # Required. The faction id from [https://jaghaimo.github.io/starsector-api/classcom_1_1fs_1_1starfarer_1_1api_1_1impl_1_1campaign_1_1ids_1_1Factions.html] or a custom faction id.
        # MagicLib includes a utility bounty faction that is forced to be neutral to everyone but the player under the id ["ML_bounty"].
        "fleet_flagship_variant":"acs_junkhubship_module_standard", # Required. The variant ID to use for the Flagship. Can be a list of variants to choose randomly from: [variant1,variant2,variant3]
        # Variant files that use ships or weapons from third party mods that may or may not be installed can be put in [data\config\modFiles\magicBounty_variants\shipVariantId.variant] to avoid crashing on launch if said mods are absent. The bounty will need the proper mod requirements to be generated without issue.
        "fleet_flagship_name":"The Wanderer", # Default: Random.
        "fleet_flagship_alwaysRecoverable": true, # Default: false. Whether the flagship will be always recoverable. Allowing this will still let the player fail the bounty if they were not supposed to recover the flagship.
        "fleet_flagship_autofit": false, # Default: false. Whether the flagship will be autofitted. When false, the Flagship does not receive D-mods or S-mods from the quality override.
        "fleet_preset_ships": {
		"legion_Assault":2, "onslaught_Standard": 2, "acs_super_champion_standard": 2, "acs_optio_standard": 4, "acs_barnabas_p_standard": 4, "acs_palatine_standard": 1,
		},
		"fleet_preset_autofit": true, # Default: false. Whether the preset ships will be autofitted. When false, the preset ships do not receive D-mods or S-mods from the quality override.
        "fleet_scaling_multiplier": 1, # Default: no scaling. Dynamic reinforcements to match that amount of player fleet DP, set to 0 to ignore.
        "fleet_min_FP": 1600, # Default: no minimum. Minimal total fleet size, set to -1 to ignore.
        "fleet_composition_faction": "derelict", # Default: bounty fleet faction. Used if the extra ships don't match the fleet's faction. For example a pirate fleet of Hegemony deserters. Required for min FP and player adjustment.
        "fleet_composition_quality": 1, # Default: 1, use 2 for no Dmods.
        "fleet_transponder": false, # Default: true.
		"fleet_no_retreat": false, #Default: false.
        "fleet_behavior": "PASSIVE", # Default:"GUARDED". The fleet's behavior on the campaign layer. Options: ["PASSIVE", "GUARDED", "AGGRESSIVE", "ROAMING"].
        # The musicSetId to use for the battle, defaults to no custom music.
        # IMPORTANT: This must be added to the mod's `sounds.json` file. See "music_combat" in the vanilla `sounds.json` for an example.
        "fleet_musicSetId": "music_luddite_encounter_hostile",

        #LOCATION

        "location_distance": "FAR", # Default: no preference. How far from the center to spawn the bounty fleet. Options: "CORE", "CLOSE", "FAR" or just left empty to ignore.
        "location_themes": [ # Default: no preference. System themes that are valid to spawn the fleet at.
            "theme_interesting",
            "theme_derelict_mothership",
            "theme_remnant",
            "theme_remnant_resurgent",

            "procgen_no_theme", #not so special bounties should add this attribute
            "procgen_no_theme_pulsar_blackhole", #or this one
        ],
        "location_themes_blacklist": [ # Default: none. System themes to never spawn the fleet at.
            "theme_already_occupied", #Will avoid systems with "hostile" themes taken from a merged list between mods. Includes all Remnant, Plague-Bearer, OCI, Blade-Breaker systems
            "theme_already_colonized", #Will explicitely exclude systems with active markets, kind of mandatory for pirate bounties given that faction colonize otherwise interesting systems with Nexerelin
            "theme_hidden", #Used by that one story system
        ],
        "location_entities": [ # Default: PLANET + JUMP_POINT + STABLE_LOCATION. Possible entities to spawn the fleet around.
            "station",
        ],
        "location_prioritizeUnexplored": true, # Default: false. Will pick in priority systems that have not been visited by the player yet, but won't override the distance requirements.
        "location_defaultToAnyEntity": true, # Default: false. If true and no suitable entity is found in any systems with the required Theme and distance, a random entity will be picked instead. Otherwise the script will ignore the distance requirements.
    },
}